import './remark.css';
import React from 'react'
import CRAlogo from "../images/CRAlogo.png";
export default function Remark() {
  return (
    <div className='page'>
      <div className='logo'>
        <img className='logo' src={CRAlogo}></img>
      </div>
      <div className='content'>
        <h1>คำแนะนำในการเลือกผู้ให้การปรึกษา</h1>
        <p>1. ทางระบบ จะเเสดงรายการผู้ให้การปรึกษาเรียงลำดับ คุณสามารถเลือกได้จากรายชื่อ ผู้ให้การปรึกษาทั้งหมด
            <br/>2. คุณสามารถเลือก ผู้ให้การปรึกษา แต่ละท่านได้จากประสบการณ์ในการให้การปรึกษา ความถนัดในหัวข้อที่คุณคิดว่าเหมาะสมกับประเด็นที่ต้องการปรึกษา
            <br/>3. ในกรณีที่คุณได้ทำการปรึกษากับผู้ให้การปรึกษาท่านใดแล้วรู้สึกว่าไม่พึงพอใจ คุณสามารถเปลี่ยน ผู้ให้การปรึกษา ในครั้งต่อไปได้ทันที ผ่านระบบการนัดหมายดังเดิม
            <br/>4. หากคุณต้องการปรึกษากับ ผู้ให้การปรึกษา กรุณาจองเวลานัดหมายล่วงหน้าอย่างน้อย 6 ชม เพื่อประสิทธิภาพในการให้การปรึกษา
        </p>
      </div>
      <div className='footer'>

      </div>
    </div>
  )
}
